export const questions = [
  {
    number: "01",
    question: "드디어 기다리던 첫 정모날이다! 쉬는 시간, 나의 행동은?",
    choices: [
      {
        text: "뭔가 아직 낯설다..<br>조용히 구석에 앉아 쉬며 핸드폰을 본다.",
        value: "i",
      },
      {
        text: "너무 신나고 재밌다!<br>옆에 있는 친구에게도 이것저것 말을 건다.",
        value: "e",
      },
    ],
  },
  {
    number: "02",
    question:
      "OSS 배틀 게스트쇼를 연습하던 중,<br>우리 팀을 맡은 선배가<br>나를 콕 집어 피드백을 해준다면?",
    choices: [
      { text: "왜 이 동작이 잘 안 되지?<br>팔을 더 크게 써볼까?", value: "t" },
      {
        text: "내 몸이 마음대로 안 된다..<br>너무 속상하다..",
        value: "f",
      },
    ],
  },
  {
    number: "03",
    question:
      "OSS 게쇼를 무사히 마쳤다!<br>이 기세를 몰아 축제도 준비하는데,<br>왠지 잘 안 맞는 것 같다.",
    choices: [
      { text: "처음부터 동작 하나하나를<br>디테일하게 맞춘다.", value: "s" },
      { text: "전체적인 느낌을 보고<br>유독 튀는 부분을 찾는다.", value: "n" },
    ],
  },
  {
    number: "04",
    question:
      "축제 공연이 끝나고 뒤풀이에서<br>친구가 내일 엠티에 가자고 꼬신다.<br>안 가려고 했는데.. 어쩌지?",
    choices: [
      {
        text: "다음주까지 내야 하는 과제가..<br>일정을 확인하고 갈지 말지 고민한다.",
        value: "j",
      },
      {
        text: "아 몰라! 과제는 미래의 내가 책임질 일!<br>놀 생각에 벌써 행복하다.",
        value: "p",
      },
    ],
  },
  {
    number: "05",
    question:
      "드디어 방학이다!<br>합숙까지 시간이 많이 있는데,<br>그동안 무엇을 할까?",
    choices: [
      {
        text: "학기동안 너무 고생한 나를 위해<br>집에서 맛있는 밥을 먹고 푹 쉰다.",
        value: "i",
      },
      {
        text: "학기 중에 못 만났던 친구들과<br>약속을 잡아서 밖에서 신나게 논다.",
        value: "e",
      },
    ],
  },
  {
    number: "06",
    question:
      "합숙이 시작되었다! 마니또도 하는데, 기숙사 우편함에 맛있는 간식이 있는 것을 발견했다.",
    choices: [
      {
        text: "초콜릿이다! 누가 내 마니또일까?<br>내가 초콜릿을 좋아하는 걸 누가 알지?",
        value: "t",
      },
      {
        text: "젤리다! 내가 좋아하는 걸로 챙겨주다니..<br> 나중에 꼭 고맙다고 해야지!",
        value: "f",
      },
    ],
  },
  {
    number: "07",
    question:
      "합숙이 끝나고, 내일은 루키 배틀!<br>첫 배틀을 준비하는 나의 자세는?",
    choices: [
      {
        text: "팀원들과 함께 루틴을 짜고 노래를 들으며<br>내 춤을 시뮬레이션 해본다.",
        value: "j",
      },
      {
        text: "역시 배틀이면 즉흥적이어야지!<br>노래부터 틀고 몸 가는 대로 춤을 춰본다.",
        value: "p",
      },
    ],
  },
  {
    number: "08",
    question:
      "2학기가 시작하고 첫 행사인 포카전!<br>배틀에 나간 선배가 너무 멋있다.<br>친해지고 싶은데.. 어쩌지?",
    choices: [
      {
        text: "선배한테 말을 걸기엔 조금 부담스럽다..<br>멀리서 응원만 한다.",
        value: "i",
      },
      {
        text: "뒤풀이 때 일단 선배에게 찾아가 말을 건다.<br>선배 너무 멋있었어요!",
        value: "e",
      },
    ],
  },
  {
    number: "09",
    question:
      "대망의 정기공연이다!<br>친구가 어떤 장르를 하고 싶냐고 물어본다면?",
    choices: [
      {
        text: "벌써 포카전 배틀에 우승해<br>저지로 초빙되는 상상까지 한다.",
        value: "n",
      },
      {
        text: "합숙에서 배웠던 각 장르를 떠올리며<br>나에게 잘 어울릴지 고민해본다.",
        value: "s",
      },
    ],
  },
  {
    number: "10",
    question:
      "정기 공연이 끝나고 뒤풀이에서<br>선배들이 내가 잘했다고 칭찬해준다.<br>이때 더 기분 좋은 칭찬은?",
    choices: [
      {
        text: "너 솔로 부분 되게 잘 짰던데?<br>이런 부분에서 구성이 진짜 좋았어.",
        value: "t",
      },
      {
        text: "너 연습 엄청 한 게 눈에 보이더라!<br>진짜 멋있게 잘 봤어. 수고 많았어!",
        value: "f",
      },
    ],
  },
  {
    number: "11",
    question:
      "곧 겨울방학인데, 개강 직후에 스낵바 공연이 있다는 걸 알게 되었다. 어떻게 준비할까?",
    choices: [
      {
        text: "개강해서 연습할 시간이 별로 없네?<br>빨리 친구들 모아서 준비해야겠다!",
        value: "j",
      },
      {
        text: "유튜브에서 멋있는 춤을 발견했다.<br>이거 해볼까? 친구들한테 바로 연락한다.",
        value: "p",
      },
    ],
  },
  {
    number: "12",
    question:
      "벌써 컨트롤디에서의 1년이 지났다!<br>앞으로 나는 어떤 춤을 더 출까?",
    choices: [
      {
        text: "난 역시 잘 짜여진 춤을 보여주는 게 좋아!<br>공연이 최고지.",
        value: "s",
      },
      {
        text: "난 역시 내 마음대로 춤을 추는 게 좋아!<br>배틀이 짱이지.",
        value: "n",
      },
    ],
  },
];

export const results = [
  {
    subtitle: "용의주도함을 갖춘",
    title: "조용한 해결사",
    results: [
      "현실적이면서도 상상력이 풍부한 전략가인 당신!",
      "관심 있는 아이디어나 목표를 달성하는 데 강한 추진력과 의지를 가지고 있습니다.",
      "만약 컨디의 총무가 된다면, 예외적인 상황까지 고려하여 효율적으로 예산을 작성해 모든 행사가 순탄할거에요!",
    ],
  },
  {
    subtitle: "나만의 독창적인 춤을 만드는",
    title: "코레오그래퍼",
    results: [
      "평범한 것을 싫어하고 지적 호기심이 뛰어난 발명가적인 당신!",
      "독창적이고 기발한 생각으로 자신만의 생각을 펼쳐나가는 것을 좋아하고 호기심이 많은 편이에요",
      "기발한 아이디어가 많은 당신이 코레오그래퍼가 된다면, 아마 아무도 상상해본 적 없는 무브가 탄생할거에요!",
    ],
  },
  {
    subtitle: "카리스마와 추진력을 갖춘",
    title: "권력의 중심",
    results: [
      "항상 문제 해결 방법을 찾아내는 의지가 강력한 통솔자형인 당신!",
      "넘치는 자신감과 카리스마, 빠른 결정력과 판단력으로 일의 목표를 설정하고 이행하는 능력이 뛰어난 편입니다.",
      "활동을 주도하기 좋아하는 당신이야말로 공연을 이끌어갈 팀장의 재목, 컨디를 부흥시킬 회장단이 될 인재가 아닐까요?",
    ],
  },
  {
    subtitle: "새로움과 독창성을 추구하는",
    title: "타고난 배틀러",
    results: [
      "생각이 깊고 대화에 거리낌이 없는 솔직한 사색가인 당신!",
      "다양한 방면에 안목이 넓고 재능이 많으며, 자신의 생각과 주관이 뚜렷해 직설적인 대화를 좋아합니다",
      "새로운 도전을 즐기는 당신이라면, 컨디에서 다양한 사람과 새로운 노래에 춤을 출 수 있는 배틀러도 잘 맞을거에요!",
    ],
  },
  {
    subtitle: "딱 맞는 조언을 해주는",
    title: "프로 피드백러",
    results: [
      "통찰력과 직관력이 뛰어나며 화합을 추구하는 이상주의자인 당신!",
      "깊은 관계를 맺는 것을 선호하는 편이며, 혼자만의 시간이 꼭 필요하지만 공동체의 발전과 이익을 중요하게 생각하는 편입니다.",
      "컨디의 리허설 때마다 따뜻한 관심과 강한 직관력으로 부족한 면을 단번에 찾아내는 당신은 그야말로 피드백의 달인!",
    ],
  },
  {
    subtitle: "즉흥적이고 창의적인 무브의",
    title: "프리스타일러",
    results: [
      "이해력과 공감력, 상상력이 뛰어난 이타주의자인 당신!",
      "유행을 따르기보다는 자신의 취향이 확실하며, 자신의 일만큼은 완벽하게 해내려는 완벽주의적 성향이 있습니다.",
      "가지고 있는 상상력과 즉흥성을 춤으로 풀어낸다면, 당신은 뛰어난 프리스타일러가 될거에요!",
    ],
  },
  {
    subtitle: "총대 매기를 두려워하지 않는",
    title: "행사 주최 장인",
    results: [
      "주변 사람을 잘 챙기고 책임감이 강한 지도자 타입의 당신!",
      "매사에 긍정적이고 말솜씨가 좋으며, 일을 진행할 땐 계획을 세워 진행하고 적극적이며 추진력이 강한 편입니다.",
      "더 밝은 컨디의 미래를 위해 배틀이나 행사를 여는 것도 마다하지 않는 당신 덕분에 컨디가 더 재밌어질거에요!",
    ],
  },
  {
    subtitle: "사람들이랑 노는 게 제일 좋아!",
    title: "술자리 핵인싸",
    results: [
      "사람들과 어울리는 걸 좋아하고 활기가 넘치는 활동가적인 당신!",
      "지루한 것을 싫어하고 상상력이 풍부하며, 하고 싶은 일이라면 즉흥적으로 도전하며 어떻게든 해내는 편입니다.",
      "새로운 사람을 만나는 것도 좋아해 컨디의 각종 행사, 엠티, 심지어 남의 공연 뒤풀이까지도 참여하는 당신은 그야말로 컨디의 마스코트!",
    ],
  },
  {
    subtitle: "기본기의 중요성을 알고 있는",
    title: "정모 개근상",
    results: [
      "체계적이고 책임감이 강하며 원리원칙적인 현실주의자인 당신!",
      "하고자 하는 일이 있다면 주위의 시선에 아랑곳하지 않고 꾸준히 성실하게 해나가는 편입니다.",
      "정모는 물론, 각종 행사 준비나 일손이 필요할 때 주어진 업무를 끝까지 완수하는 당신은 컨디에 꼭 필요한 기둥같은 존재입니다!",
    ],
  },
  {
    subtitle: "남의 일도 내 일처럼 도와주는",
    title: "멘탈 구조대",
    results: [
      "조용하고 헌신적이며 친근한 수호자같은 당신!",
      "동정심이 많고 다른 사람의 감정에 민감한 한편, 현실 감각을 갖고 분별력있게 일을 처리하여 집단에 안정감을 주는 편입니다.",
      "컨디에서 누군가 연습을 힘들어한다면 지나치지 못할 당신은 후배들에게 따스한 선배가 될 수 있을거에요!",
    ],
  },
  {
    subtitle: "학점과 공연을 모두 챙기는",
    title: "헤르미온느",
    results: [
      "자기 관리에 철저하고 목표지향적인 사업가적인 당신!",
      "추진력과 결단력이 강하고 현실 감각이 뛰어나 문제를 잘 해결해내며, 사람들과도 잘 사귀는 편입니다.",
      "자신이 계획한 일은 모두 지키려고 노력하기 때문에 학점과 컨디, 두 마리 토끼를 챙기는 갓생러일 확률이 높아요!",
    ],
  },
  {
    subtitle: "누구보다 행사에 진심인",
    title: "리액션 팡팡러",
    results: [
      "애정과 관심 쏟기를 좋아하고 사람 만나는 것을 좋아하는 마당발인 당신!",
      "마음이 따뜻하고 배려심이 많으며, 다른 사람들에게 관심이 많고 대화하는 것을 좋아하는 편입니다.",
      "각종 행사에서 사람들의 직캠을 찍고 누구보다 호응을 잘해주며 공연 만족도를 최상으로 만들어주는 당신은 컨디 최고의 분위기 메이커입니다!",
    ],
  },
  {
    subtitle: "무엇이든 잘 하는",
    title: "만능 퍼포머",
    results: [
      "논리적이고 관찰력이 뛰어나며 만능 재주꾼 기질이 있는 장인같은 당신!",
      "상황을 민첩하게 잘 파악하며, 조용하고 과묵하게 사람들을 관찰하는 경향이 있습니다.",
      "효율을 추구하면서도 하나에 꽂히면 끝장을 봐야 하는 당신은 어떤 종류의 공연이든 잘 소화할 수 있는 퍼포머가 아닐까요?",
    ],
  },
  {
    subtitle: "조용하지만 끼도 있는",
    title: "무대 위 반전매력",
    results: [
      "다정하고 친절하면서도 자유롭고 모험적인 예술가형인 당신!",
      "충돌과 갈등을 좋아하지 않으며, 다른 사람의 의견을 이해하고 포용할 수 있으며 적응력이 뛰어나 항상 여유로운 편입니다.",
      "평소에는 조용하고 겸손하지만, 막상 무대 위에서는 몰입하여 매력을 뽐내는 당신은 그야말로 반전 매력의 화신입니다!",
    ],
  },
  {
    subtitle: "바쁘다 바빠 컨디 사회!",
    title: "공연 N탕러",
    results: [
      "문제해결능력이 뛰어나고 추진력이 강한 사업가적인 당신!",
      "임기응변이 뛰어나며 개방적이고 선입견이 적습니다. 또한 활동적이며 사람들을 만나며 에너지를 얻는 편입니다.",
      "자유분방하고 스릴을 즐기는 당신은 스낵바 N탕마저도 해내며 끝내주는 컨디 생활을 즐길 수 있을거에요!",
    ],
  },
  {
    subtitle: "끼와 에너지가 반짝반짝 빛나는",
    title: "확신의 센터상",
    results: [
      "활동적이고 밝으며 흥이 많고 하이텐션인 연예인같은 당신!",
      "무대뿐만 아니라 평소에도 사람들과 어울리는 것을 좋아하고 센스와 유머도 좋아 핵인싸의 기질이 다분한 편입니다.",
      "사교적이고 주목받는 것을 무척 좋아하는 당신에게는 역시 컨디가 제격이 아닐까요?",
    ],
  },
];

export const mbtis = {
  intj: 0,
  intp: 1,
  entj: 2,
  entp: 3,
  infj: 4,
  infp: 5,
  enfj: 6,
  enfp: 7,
  istj: 8,
  isfj: 9,
  estj: 10,
  esfj: 11,
  istp: 12,
  isfp: 13,
  estp: 14,
  esfp: 15,
};
